[
    {
        "content": "Kwara State University Governor AbdulRahman AbdulRazaq CON today made another history when he commissioned the Osi Campus of Kwara State University. Kwara State University KWASU begins petrol vehicle conversion to CNG Kwara State University Governor AbdulRahman AbdulRazaq has appointed Professor Shaykh-Lukman Jimoh as new KWASU Vice-Chancellor!!! Kwara State University Kwara State Governor inspecting a bus converted by the Centre for Sustainable Energy from petrol to electricity powered Welcome to Kwara State University, Malete. The Green University for community development and entrepreneurship. Governor AbdulRahman AbdulRazaq CON today made another history when he commissioned the Osi Campus of Kwara State University. It was a gathering of the who-is-who in Kwara State as he formally launched the take-off of the 1st of the 2 multicampus facilities of the Green University for Community Development and Entrepreneurship. \n\n0\n\n\n0\n\n \nCommissioning of Osi Campus\n \n\nKwara State University, Malete\n\n\n3 views\n\n\nJanuary 9, 2025 9:32 am\n\n \nGovernor AbdulRahman AbdulRazaq CON today made another history when he commissioned the Osi Campus of Kwara State University. It was a gathering of the who-is-who in Kwara State as he formally launched the take-off of the 1st of the 2 multicampus facilities of the Green University for Community Development and Entrepreneurship. ...\n Convocation for Award of Undergraduate and Postgraduate Degrees and Prizes \n\n2\n\n\n0\n\n \nConvocation for Award of Undergraduate and Postgraduate Degrees and Prizes - Part 1\n \n\nKwara State University, Malete\n\n\n12 views\n\n\nDecember 17, 2024 1:25 pm\n\n \nConvocation for Award of Undergraduate and Postgraduate Degrees and Prizes ...\n Convocation for Award of Undergraduate and Postgraduate Degrees and Prizes - Continuation \n\n4\n\n\n0\n\n \nConvocation for Award of Undergraduate and Postgraduate Degrees and Prizes - Part 2\n \n\nKwara State University, Malete\n\n\n25 views\n\n\nDecember 14, 2024 2:57 pm\n\n \nConvocation for Award of Undergraduate and Postgraduate Degrees and Prizes - Continuation ...\n Welcome to the Green University for Community Development and Entrepreneurship, Kwara State University, Malete. Here, in our beautiful campus in the suburb of the state capital, we inspire minds, motivate development from the basic level, enhance social interaction, initiate revolutionary ideas, and push for better ways of doing things. We are a state-owned institution that keys into policies that target development of the individual, community, and the global society. Our research reflects our mantra: innovation towards promoting sustainable environments, development of communities, and enhancing entrepreneurial mindset for economic sustainability. Explore our campus and all we have on offer at Kwara State University! View all undergraduate and postgraduate programs."
    },
    {
        "content": "KWASU Engineers Convert Petrol Engine Bus to Electric Bus Engineers of Kwara State University’s Centre for Sustainable Energy have successfully converted a petrol-engine bus to an electricity driven one. The Acting Vice-Chancellor, Professor Shaykh-Luqman Jimoh while presenting the bus to the Kwara State Governor, Mallam AbdulRahman AbdulRazaq on Thursday, August 24, 2023 at the State Government House in Ilorin said the University was constantly in tune with realities in the society through the innovation of products and ideas to support the vision of the State Government to advance the lives of the peoples. Prof Jimoh added that the bus was conceptualised and designed with realities of electricity supply in the country, which made the bus more efficient and effective. The Governor who was visibly excited, described the innovation as “a clear indication that we are fast turning the corners as our country steadily joins the world to reduce over reliance on fossil fuel and adopt cleaner energy”. Mallam AbdulRahman noted that the innovation was coming at an excellent time, especially when governments at all levels within the country were making different efforts to ease the challenges brought by the removal of subsidy on petrol. He commended the management of the University and the team of engineers led by the Head of Technical Unit of the Centre for Sustainable Energy and Chief Technologist at the Department of Electrical and Computer Engineering, AbdulAzeez Akande for expediting the realisation of the electric bus. “I commend the Acting Vice Chancellor, Professor Shaykh Lukman Jimoh, who led the team to Government House Thursday morning, all of them driven in the electric vehicle.” The governor assured the team of the State Government’s constant support as they do more to deploy technology and their own will-power to make life better. Meanwhile, the Kwara State Governor has directed the engineering team of Kwara State University, Malete, to convert some government vehicles to use electricity for immediate deployment on campuses for the benefits of students. Your email address will not be published. Required fields are marked *  Save my name, email, and website in this browser for the next time I comment.  \n\n Δ Search Categories"
    },
    {
        "content": "Search Categories"
    },
    {
        "content": "We are a leading institution of higher learning located in the vibrant city of Malete in Western Nigeria. Established in 2009, we have a rich history of providing top-quality education to students from all over the country and beyond. Our campus is home to a diverse student body, with over 30,000 students enrolled in a wide range of undergraduate and graduate programs. We are dedicated to providing our students with the knowledge, skills, and experiences they need to succeed in their chosen careers and make a positive impact on their communities. At the Kwara State University, we offer a range of academic programs in the arts, sciences, engineering, and other fields. Our faculty are leaders in their respective fields, and are committed to providing a supportive and challenging learning environment for our students. In addition to our academic programs, we also offer a range of extracurricular activities and student services, including clubs and organizations, sports teams, and health and wellness resources. We are proud of our strong sense of community and our commitment to helping our students reach their full potential. We hope you will consider joining us at Kwara State University!"
    },
    {
        "content": "The Alumni Relations office was established in 2013 and took off in same year with the first convocation. The office was headed by Mrs. Hawa Kamaldeen (then an Asst. Reg.) at inception. She served as the coordinator of the office alongside two other supporting staff. Together, they set the pace and were actively involved in cementing a veritable and healthy relationship between the alumni and Kwara State University. Every year, graduating students fill alumni registration form, which is used to build the alumni database. Recently though, the registration is being done electronically to accommodate all alumni where ever they are. Social media pages have also been created for regular engagements and interactions with the alumni, thus strengthening relationship with all concerned. The Alumni Relations Unit is very germane to the running of a university. What do they do? The Unit is charged with the responsibility of ‘selling memories’ and ensuring the sustenance of thorough bonding between alumni and the university. The more memories we sell, the more students’ experiences we enrich. It is believed that a student with rich and memorable experience from admission to graduation will give back to his/her alma mater with great pleasure. It gives me great pleasure to welcome our esteemed alumni, most cordially, to this beautiful forum that serves as a major information platform for KWASU Alumni. This was conceptualized and developed to have a platform that will serve as a potpourri of ideas between the university and our great alumni. You will agree with me that Kwara State University is an enigma among its peers. It is a beautiful university; a fulcrum of knowledge and character that is steadily threading the path of becoming a world-class university. As a relatively nascent institution, it is equally ready to positively dare. This is the culmination of an enormous collective effort of its founding fathers in their quest to provide a world-class university for our citizens. Since 2009, KWASU has enjoyed an uninterrupted academic calendar. This great institution has molded characters and forged individuals with fantastic academic records that have made our alumni compete favorably in the labor market and contribute their quota to socio-economic developments, both locally and internationally. The Alumni Relations Unit which was established in 2013, has been experiencing an exponential increase in the number of alumni out there. They are everywhere in the globe, making waves in different sectors, helping build the economy, and making the institution proud through their credible, creative, daring, and impressive contributions, in their bid to make positive change in the world we live in. Through this forum, our great alumni should volunteer themselves for the growth and development of this institution. They should also see themselves as the fulcrum of resourceful and purposeful bonding. Through this, a lifelong relationship between them and the university could be sustained. Distinguished alumni, it is on this note that I, on behalf of the management, wish you all, fruitful endeavors that will make KWASU and the entire nation proud.\nThank you and God bless. KWASU Alumni Association is an association of graduates of Kwara State University. Its membership cut across all corners of the world, in various disciplines and fields. This noble association exists as an intermediary between graduates and their alma mater to ensure that beyond university life, graduates have a sense of responsibility to their alma mater; give back as much as the University has given to them and serve as mentors to the current students. Furthermore, this association functions to ensure there is a smooth relationship amongst graduates by creating a network of intellectual minds in key and relevant areas of life. The Association offers a host of benefits not just limited to graduates of Kwara State University but also the host communities by engaging in several community outreach projects.\nMany undergraduate students have also benefitted from our annual scholarships and leadership training. The criteria are usually published through our Social Media Platforms, and we will also be expecting more undergraduate students to apply.\nThe first reunion programme was held in November 2021. It just got better in 2024. I am sure you graced the occasion too and trust you had a memorable moment reuniting with old friends and took time to do proper networking along the line. The whole essence is to bring our members together for networking, marketing, and celebrating one another. It is good to know that many of our graduates are contributing their quota to the development of the University.\nThe Alumni may be said to be nascent, its stride depicts that of a giant. As we uphold our noble course by living true to our oath as alumni, together we shall continue to carry the torch as  worthy ambassadors of this great institution called kwasu.\nThank you and God bless you all.\nAliyu Uthman Abdulkadir\n\n(Aka Fodio)\n\nNational President \nMany undergraduate students have also benefitted from our annual scholarships and leadership training. The criteria are usually published through our Social Media Platforms, and we will also be expecting more undergraduate students to apply.\nThe first reunion programme was held in November 2021. It just got better in 2024. I am sure you graced the occasion too and trust you had a memorable moment reuniting with old friends and took time to do proper networking along the line. The whole essence is to bring our members together for networking, marketing, and celebrating one another. It is good to know that many of our graduates are contributing their quota to the development of the University.\nThe Alumni may be said to be nascent, its stride depicts that of a giant. As we uphold our noble course by living true to our oath as alumni, together we shall continue to carry the torch as  worthy ambassadors of this great institution called kwasu.\nThank you and God bless you all.\nAliyu Uthman Abdulkadir\n\n(Aka Fodio)\n\nNational President Many undergraduate students have also benefitted from our annual scholarships and leadership training. The criteria are usually published through our Social Media Platforms, and we will also be expecting more undergraduate students to apply. The first reunion programme was held in November 2021. It just got better in 2024. I am sure you graced the occasion too and trust you had a memorable moment reuniting with old friends and took time to do proper networking along the line. The whole essence is to bring our members together for networking, marketing, and celebrating one another. It is good to know that many of our graduates are contributing their quota to the development of the University.\nThe Alumni may be said to be nascent, its stride depicts that of a giant. As we uphold our noble course by living true to our oath as alumni, together we shall continue to carry the torch as  worthy ambassadors of this great institution called kwasu. Thank you and God bless you all."
    },
    {
        "content": "Search Categories"
    },
    {
        "content": " Kwara State University, Malete received the “Most Outstanding Tertiary Institution” award at the 2022 Nigeria Union of Journalists NUJ Annual Press Week/Dinner Award Night. The event which was held at the Kwara State Banquet Hall, had in attendance the Governor of Kwara State, Mallam AbdulRahman AbdulRazaq who received the award on behalf of the institution. KWASU Professor Bags KWSG’s Lifetime Achievement Award In yet another achievement being recorded by staff and students of the Green University for Community Development and Entrepreneurship, a professor with Kwara State University, Malete has received the State Government’s Lifetime Achievement Award in recognition of his exemplary contributions to society. Professor David Babalola, a professor of Church History and Theology in the department of Religions, History and Heritage studies received the award during the State Government’s celebration of distinguished indigenes of the State on Friday December 23, 2022. The award which read that it was “in appreciation of your accomplishments, outstanding character, work ethics and commitment to uplifting human dignity in the society” was one of the ways the State Government was promoting excellence, patriotism and hard work among the indigenes of the State. Responding to award, the Acting Vice Chancellor, Professor Shaykh Luqman Jimoh, expressed great joy and excitement describing it as a recognition of quality of service from members of the Kwara State University community to the state, nation and world at large. Prof. Jimoh congratulated the recipient adding that the award would motivate all members of the University to strive more for excellence. The Acting Vice Chancellor described Professor Babalola as an excellent scholar who was keen on contributing to society as exemplified by his continued service to educating the coming generation even after retirement. Professor David Babalola was born in Omu-Aran in Irepodun Local Government Area of Kwara State and attended schools in Ilishan-Remo in Ogun State, Michigan USA, Ile-Ife and Ibadan. He earned a B.A. Theology/History in 1973, B.A. History in 1976, M.A. History in 1977, Master of Divinity in 1979 and a Ph.D. in Church History in 1988. Professor Babalola attained the rank of Professor in 2004 and is the first from Kwara State to be appointed President of Seventh-day Adventist Church in Western States (which comprised Kwara, Kogi, Oyo, Ogun, Osun, Ekiti, Ondo and Lagos states). He is also the pioneer General Secretary of Seventh-day Adventist (SDA) Church in Nigeria and Senior Pastor for Babcock University, Ilishan-Remo. He served as the pioneer Deputy Vice Chancellor, Management Services at Babcock University, Ilishan-Remo before joining the services of Kwara State University where he currently heads the Christian Studies unit. Professor Babalola has many publications in both international and national outlets particularly on the history and administration of Seventh Day Adventists in Nigeria. He has also received many national and international awards before this honour by the Kwara State Government. Dr. Saeedat AliyuAg. Director, University Relations  KWASUScholarAwardWinnerGreenUniversityResearchExcellenceGiveItUpForKWASUKWASURocks KWASU’s Dr. Samsudeen Azeez of the Department of Chemistry and Industrial Chemistry emerged 2nd runner up in the Oral Presentation Award at the 5th Nigeria Academy of Science Conference. His presentation was titled “Preparation and Characterization of Novel Mixed Nano-metal Oxides Composited with Activated Kaolinitic Clay for Photodegradation of Rhodamine B”."
    },
    {
        "content": "Applications are invited from suitably qualified candidates for admission into Pre-Degree/Remedial and IJMB/JUPEB Programmes of the Kwara State University, Malete. Programme Description The programmes, which are for duration of one Academic year are: 1. IJMB/JUPEB planned to intensively prepare students to obtain admission into 200 Level in any University;2. Remedial Programme is planned to prepare candidates who have deficiencies in WASSCE, NECO, GCE, JAMB and NABTEB results for admission into various Degree Programmes of KWASU after taking UTME and meeting all necessary requirements to obtain admission into 100 Level and to be given their choice of courses. Admission Requirements For IJMB/JUPEB, candidates must have five credit passes in relevant subjects including English Language at not more than (two) 2 sittings in O’Level WASSCE, NECO or GCE. For the Remedial Programme, candidates must have at least three (3) credit passes in the relevant subjects to include English or Mathematics in O’Level WASSCE, NECO or GCE at a sitting. How To Apply:To obtain the Application Form, candidates are to pay the sum of:➢ Remedial – N15,000.00➢ IJMB/JUPEB – N15,000.00 School Fees:➢ Remedial➢ : Total fees payable Twice      • Science students – N100,000.00      • Non-Science students – N90,000.00➢ IJMB/JUPEB : Total fees payable      • Science students – N210,000.00      • Non-Science students – N195,000.00 Apply Online At portal.kwasu.edu.ng. All payment should be done online through KWASU payment platformFor further enquiries visit our website: www.kwasu.edu.ng OR Contact the Following Numbers:08133327209, 08038315408, 08167998627 & 08062075797 Apply Now"
    },
    {
        "content": "You may check out all the available products and buy some in the shop. \n\n\t\t\tReturn to shop\t\t\n"
    },
    {
        "content": "Search Categories"
    },
    {
        "content": "Search Categories"
    },
    {
        "content": "Search Categories"
    },
    {
        "content": "Search Categories"
    },
    {
        "content": "Kwara State University has several academic centers. One of such centers is the Center for Ecology and Environmental Management and Studies CEERMS, which recently received a grant from UNESCO worth $15.3 million to be used over a six-year period to establish the UNESCO Chair for Alternative Energy Programme. This grant is for research in Alternative Energy and is to be handled by Kwara State University Center for Ecological and Environmental Research Management Studies (CEERMS).\nOther centers of the University are: Center for African Oral Traditions, Institute for Asian Studies, Ibrahim Gambari Center for the Study of United Nations and Regional Organizations, Center for Pre-degree and Remedial Studies, Center for Human Rights and the law, Center for Modernity and Religion, Center for Art Preservation, Center for Sponsored Projects, Center for Innovation in Teaching and Research, Center for Innovative Technology, Center for Innovation and International Studies, Center for Bio-Computational Applications and the Center for Entrepreneurship.\nIt currently has a partnership with Thammasat University in Thailand; Korean Advanced Institute of Technology (KAIST), South Korea; Columbia University, New York, USA; University of the State of Bahia (UNEB), Salvador, Brazil; Texas Southern University, Houston, TX, USA; etc. Its teaching staff consists of scholars such as Prof. Leo Daniels, MLK Professor of Aeronautics and Astronautics at Massachusetts Institute of Technology, (MIT) as Provost at the College of Engineering and Technology, Prof. Abiola Irele from Harvard University as Provost at the College of Humanities, Management and Social Sciences; and Prof. Winston Wole Soboyejo from Princeton University among others. One of the few schools in Nigeria to offer Aeronautical engineering\t\t\t\t\t Other centers of the University are: Center for African Oral Traditions, Institute for Asian Studies, Ibrahim Gambari Center for the Study of United Nations and Regional Organizations, Center for Pre-degree and Remedial Studies, Center for Human Rights and the law, Center for Modernity and Religion, Center for Art Preservation, Center for Sponsored Projects, Center for Innovation in Teaching and Research, Center for Innovative Technology, Center for Innovation and International Studies, Center for Bio-Computational Applications and the Center for Entrepreneurship.\nIt currently has a partnership with Thammasat University in Thailand; Korean Advanced Institute of Technology (KAIST), South Korea; Columbia University, New York, USA; University of the State of Bahia (UNEB), Salvador, Brazil; Texas Southern University, Houston, TX, USA; etc. Its teaching staff consists of scholars such as Prof. Leo Daniels, MLK Professor of Aeronautics and Astronautics at Massachusetts Institute of Technology, (MIT) as Provost at the College of Engineering and Technology, Prof. Abiola Irele from Harvard University as Provost at the College of Humanities, Management and Social Sciences; and Prof. Winston Wole Soboyejo from Princeton University among others. One of the few schools in Nigeria to offer Aeronautical engineering\t\t\t\t\t"
    },
    {
        "content": "Governor AbdulRahman AbdulRazaq CON today made another history when he commissioned the Osi Campus of Kwara State University. It was a gathering of the who-is-who in Kwara State as he formally launched the take-off of the 1st of the 2 multicampus facilities of the Green University for Community Development and Entrepreneurship. #historymade\n#OsiCampusLaunched\n#KWASUgrows\n#GovAA Your email address will not be published. Required fields are marked *  Save my name, email, and website in this browser for the next time I comment.  \n\n Δ Search Categories"
    },
    {
        "content": "\nUndergraduate\n \nGraduate and Professional\n"
    },
    {
        "content": "Dear University Community, It is my joy to welcome you to the Convocation Week to graduate the 12th set of graduates of our great University. The activities commence tomorrow, Tuesday 10th December, 2024, with the VICE CHANCELLOR’S PRESS BRIEFING\nVenue: Muhammadu Buhari Main Library, KWASU campus Malete\nTime: 11.00 a.m. This will be followed by the OFFICIAL OPENING OF EXHIBITION BY UNITS OF THE UNIVERSITY\nVenue: Muhammadu Buhari Main Library, KWASU campus Malete\nTime: Immediately after the Press Briefing Then, there will be a FOOTBALL MATCH between Academic Staff and Non- Teaching Staff,\nVenue: University Stadium Complex, Malete\nTime: 3.00 p.m. On Thursday, 12th December, 2024, there will be CONVOCATION LECTURE to be delivered by Emeritus Professor Abubakar Sani Sambo, OON, FAS, the President- elect, Nigerian Academy of Science.\nThe topic is “The Optimum Utilisation of Nigeria’s Energy Resources for the Sustainable Growth and Development of the Nation”. The venue is Mini Convocation Arena at 11.00 am. There will also be a CONVOCATION PLAY by the Department of Performing Arts and Film Studies. The play this year is titled Mojagbe written by Ahmed Yerima.\nThe venue is the newly completed Ultra- Modern Performing Arts Building, KWASU, Malete at 2.00pm. Saturday, 14th December, 2024, is the D-Day. This is the CONVOCATION FOR THE AWARD OF UNDERGRADUATE AND POSTGRADUATE DEGREES AND PRIZES\nThe venue is the Ultra- Modern Performing Arts Building, KWASU, Malete. I ask that as a university, we participate in this week’s activities. This is our week to celebrate the years we all have spent to train and groom the exceptional graduates of Kwara State University. I look forward to seeing you all. Professor Shaykh-Luqman Alade Jimoh fcipdm, fcpa\nVice-Chancellor\nhttps://www.instagram.com/p/DDWzhUJshs_/?igsh=emgwMDJseWhjd3Y0 Your email address will not be published. Required fields are marked *  Save my name, email, and website in this browser for the next time I comment.  \n\n Δ Search Categories"
    },
    {
        "content": "Download Programme Activities – PDF "
    },
    {
        "content": "Search \nFilter by Categories Instructors Locations Price Ratings Language Level Duration"
    },
    {
        "content": "This is to bring to the notice of the public that the following one hundred and seventy-five students have been expelled from Kwara State University, Malete, for various offenses. The approval of the expulsion followed the recommendations of the Students’ Disciplinary Committee which held sittings between October 2021 and March 2024. The expelled students were penalized for offenses ranging from examination malpractice, theft, using fake results to gain admission, assault, fraud, belonging to unregistered associations and possession of firearm. The Management of Kwara State University wishes to reiterate its zero-tolerance for all acts of indiscipline as the institution stands firm on producing graduates who are excellent both in character and in learning. Click the link to see the list Dr. Saeedat AliyuAg. Director, University Relations"
    },
    {
        "content": " BravoBoostingEnvironmentalHealth 2ndInductionCeremonyProfessionalEnvironmentalHealthScientists KWASU makes another history as 202 newly qualified Environmental Health Scientists for 2022/2023 have been sworn-in and inducted into the Environmental Health Council of Nigeria at the 2nd oath-taking and induction ceremony held on Thursday, May 9, 2024.  "
    },
    {
        "content": "Find events Popular events Popular tags"
    },
    {
        "content": "12th CONVOCATION CEREMONY OF KWARA STATE UNIVERSITY, MALETE INFORMATION TO GRADUAND This is to inform all the 2023/2024 graduands of the Kwara State University, Malete that the 12th Convocation Ceremony for the award of First and Postgraduate Degrees and presentation of prizes will hold on Saturday 14th December, 2024.   Download Programme Activities – PDF Malete, Kwara State \n\n\t\t\t\t\t\t\t+ Google Map\t\t\t\t\t\t\n This event has expired"
    },
    {
        "content": "Fourth Quarter 2024 Community Health Outreach Baruten \n\n\t\t\t\t\t\t\t+ Google Map\t\t\t\t\t\t\n This event has expired"
    },
    {
        "content": "Revitalizing The Humanities: Rethinking Canon , and Curriculum and Context Malete, Kwara State \n\n\t\t\t\t\t\t\t+ Google Map\t\t\t\t\t\t\n This event has expired"
    },
    {
        "content": "You are welcome to the Faculty of Agriculture, Kwara State University, Malete, Nigeria. The faculty has four departments: the Department of Agricultural Economics and Extension Services, the Department of Animal Production, the Department of Crop Production, and the Department of Food Science and Technology. The faculty offers a broad-based programme leading to the award of the Bachelor of Agriculture (B. Agric.) degree with a specialization in the final year in any of the following options: Agricultural Economics, Agricultural Extension, Crop Production, Crop Protection, and Animal Production. It also offers a Bachelor of Science (B.Sc.) degree in Food Science and Technology. The B. Agriculture and B. Sc. (Food Science and Technology) degrees have full accreditation status by the National Universities Commission (NUC). Both the M.Sc. and Ph.D. degrees in Agricultural Economics and Farm Management, Agricultural Extension and Rural Development, Crop Production and Animal Production also have full accreditation status. Currently, there are about 35 staff and over 1,000 undergraduate students, and scores of postgraduate students in the faculty, across the four departments.  The faculty has a Teaching and Research farm sitting on about 100 hectares of land that serves as a field laboratory for students’ training, staff research, and demonstration for farmers. The faculty has collaboration and linkages with national research institutes and agricultural development agencies like the Lower River Niger Basin Development Authority (LRNBDA), Agricultural Research and Management Training Institute (ARMTI), National Centre for Agricultural Mechanization (NCAM), International Institute of Tropical Agriculture (IITA), and the Ministry of Agriculture, among others. The present Faculty of Agriculture, which started as a College of Agriculture, is as old as the University. It was established as one of the foundation Colleges of the University at the inception of the University in November 2009. The College, which started with seven academic staff and 16 students, had Professor Funsho Oluleye as the Pioneer Provost, with 3 Departments namely: Department of Agricultural Economics and Extension Services, Department of Animal Production, and Department of Crop Production. The faculty system was adopted in 2020 across the university, to replace the former collegiate system. Former Provosts of the then College of Agriculture were Professor Funsho Oluleye, Professor Olawale Moshood Aliyu, and Prof. Stephen Kayode Subair, currently as the Dean. The Department of Food Science and Technology started in the College of Engineering and Technology as a part of the Department of Food, Agriculture and Bioengineering (FAB) in 2011. It was recently separated from FAB and moved to the College of Agriculture. Site Visits – Department of Agricultural Economics and Extension Services Site Visits – Department of Animal Production, Fisheries and Acquaculture Site Visits – Department of Crop Production Site Visits – Department of Food Science and Technology Several research activities are ongoing in the faculty of Agriculture, some of which are listed below: Food product development, consumer studies/product acceptability, storage stability/shelf-life studies, food characterization and formulations, and suitability of different crops variety for food products, among others Lipids studies in Nigerian diets with respect to health and diseases. Studies on fermentation and food safety/food biotechnology  Studies on food processing, preservation, product development and value addition Solid State Fermentation of non-conventional feedstuffs for enhanced pig production. Artificial Insemination of indigenous breeds of cattle to enhance Meat production. Silage production for small ruminants. Phytobiotics feed additives in enhancing fish production. The faculty has recorded several laudable achievements and milestones since its inception. Some of these are listed below: E-mail Address: stephen.subair@kwasu.edu.ng / ssksubair@gmail.comPhone Number: Not Available For Now Research Interest/Specialisation:Agricultural Extension and Rural DevelopmentEducational Qualification:  Membership of Professional Bodies: i. Member, South African Society of Agricultural Extension E-mail Address: jimoh.aremu@kwasu.edu.ngPhone Number: Not Available For Now Research Interest/Specialisation:Animal ProductionEducational Qualification:  Membership of Professional Bodies: i. Member Animal Science Association of Nigeria E-mail Address: James.aina@kwasu.edu.ngPhone Number: Not Available For Now Research Interest/Specialisation:Agriculture/Aquaculture and FisheriesEducational Qualification:  Membership of Professional Bodies: i. Fisheries Society of Nigeria (FISON) E-mail Address: Isaac.dada@kwasu.edu.ngPhone Number: Not Available For Now Research Interest/Specialisation: Crop ProductionEducational Qualification:  Membership of Professional Bodies: i. Not Available For Now E-mail Address: ameenulahi.okandeji@kwasu.edu.ngPhone Number: Not Available For Now Research Interest/Specialisation: Crop ProductionEducational Qualification:  Membership of Professional Bodies: i. Not Available For Now E-mail Address: ganiyu.jimoh@kwasu.edu.ngPhone Number: Not Available For Now Research Interest/Specialisation: Animal ProductionEducational Qualification:  Membership of Professional Bodies: i. Not Available For Now E-mail Address: sulaiman.kolawole@kwasu.edu.ngPhone Number: Not Available For Now Research Interest/Specialisation: Farm power and machineryEducational Qualification:  Membership of Professional Bodies: i. Member of Council for Regularization of Engineering in Nigeria E-mail Address: mmahmudyisa@gmail.comPhone Number: Not Available For Now Research Interest/Specialisation: Animal ProductionEducational Qualification:  Membership of Professional Bodies: i. Not Available For Now E-mail Address: babajiyah@gmail.comPhone Number: Not Available For Now Research Interest/Specialisation: Agricultural EconomicsEducational Qualification:  Membership of Professional Bodies: i. Not Available For Now E-mail Address: babajiyah@gmail.comPhone Number: Not Available For Now Research Interest/Specialisation: Crop ProductionEducational Qualification:  Membership of Professional Bodies: i. Not Available For Now E-mail Address: Not Available For NowPhone Number: Not Available For Now Research Interest/Specialisation: Crop ProductionEducational Qualification:  Membership of Professional Bodies: i. Not Available For Now E-mail Address: Not Available For NowPhone Number: Not Available For Now Research Interest/Specialisation: Crop ProductionEducational Qualification:  Membership of Professional Bodies: i. Not Available For Now E-mail Address: Not Available For NowPhone Number: Not Available For Now Research Interest/Specialisation: Tractor OperatorEducational Qualification:  Membership of Professional Bodies: i. Not Available For Now E-mail Address: Not Available For NowPhone Number: Not Available For Now Research Interest/Specialisation: Tractor OperatorEducational Qualification:  Membership of Professional Bodies: i. Not Available For Now E-mail Address: Not Available For NowPhone Number: Not Available For Now Research Interest/Specialisation: Animal ProductionEducational Qualification:  Membership of Professional Bodies: i. Not Available For Now E-mail Address: Not Available For NowPhone Number: Not Available For Now Research Interest/Specialisation: Animal ProductionEducational Qualification:  Membership of Professional Bodies: i. Not Available For Now E-mail Address: Not Available For NowPhone Number: Not Available For Now Research Interest/Specialisation: Animal rearingEducational Qualification:  Membership of Professional Bodies: i. Not Available For Now E-mail Address: Not Available For NowPhone Number: Not Available For Now Research Interest/Specialisation: Animal rearingEducational Qualification:  Membership of Professional Bodies: i. Not Available For Now E-mail Address: Not Available For NowPhone Number: Not Available For Now Research Interest/Specialisation: Animal rearingEducational Qualification:  Membership of Professional Bodies: i. Not Available For Now E-mail Address: Not Available For NowPhone Number: Not Available For Now Research Interest/Specialisation: Animal rearingEducational Qualification:  Membership of Professional Bodies: i. Not Available For Now E-mail Address: Not Available For NowPhone Number: Not Available For Now Research Interest/Specialisation: Animal rearingEducational Qualification:  Membership of Professional Bodies: i. Not Available For Now E-mail Address: Not Available For NowPhone Number: Not Available For Now Research Interest/Specialisation: Animal rearingEducational Qualification:  Membership of Professional Bodies: i. Not Available For Now E-mail Address: Not Available For NowPhone Number: Not Available For Now Research Interest/Specialisation: SecurityEducational Qualification:  Membership of Professional Bodies: i. Not Available For Now E-mail Address: Not Available For NowPhone Number: Not Available For Now Research Interest/Specialisation: SecurityEducational Qualification:  Membership of Professional Bodies: i. Not Available For Now E-mail Address: Not Available For NowPhone Number: Not Available For Now Research Interest/Specialisation: SecurityEducational Qualification:  Membership of Professional Bodies: i. Not Available For Now E-mail Address: Not Available For NowPhone Number: Not Available For Now Research Interest/Specialisation: SecurityEducational Qualification:  Membership of Professional Bodies: i. Not Available For Now E-mail Address: stephen.subair@kwasu.edu.ng / ssksubair@gmail.comPhone Number: Not Available For Now Research Interest/Specialisation:Agricultural Extension and Rural DevelopmentEducational Qualification:  Membership of Professional Bodies: i. Member, South African Society of Agricultural Extension E-mail Address: haruna.liman@kwasu.edu.ng/ mohammedhl007@gmail.comPhone Number: 08035591604Research Interest/Specialisation: Not Available For NowEducational Qualification: Not Available For Now Membership of Professional Bodies: Not Available For Now ii. Academic Society for Arabic Literature in Nigeria (ASALLIN). E-mail Address: Umar0164@gmail.comPhone Number: 08162810698Research Interest/Specialisation: Not Available For NowEducational Qualification: Not Available For Now Membership of Professional Bodies: Not Available For Now ii. Academic Society for Arabic Literature in Nigeria (ASALLIN). E-mail Address: abdulkadirmisra54@gmail.comPhone Number: 08062722880Research Interest/Specialisation: Not Available For NowEducational Qualification: Not Available For Now Membership of Professional Bodies: Not Available For Now ii. Academic Society for Arabic Literature in Nigeria (ASALLIN). E-mail Address: medinat.mumini@kwasu.edu.ngPhone Number: 07031091203Research Interest/Specialisation: Not Available For NowEducational Qualification: Not Available For Now Membership of Professional Bodies: Not Available For Now ii. Academic Society for Arabic Literature in Nigeria (ASALLIN)."
    },
    {
        "content": "I am thrilled to welcome you to the Faculty of Arts, Kwara State University, Malete. Our faculty provides a well-rounded education that prepares our students for success in their chosen fields. We offer programmes on various aspects of the arts, including literature, history, religions, performing arts, film production, fine and applied arts, and languages. Our faculty members are experts in their respective fields and committed to providing high-quality instruction to our students and helping them to develop excellent communication skills, creative and critical thinking skills, and a deep understanding of indigenous cultures and the world around them. The programme-based level advisers at your respective departments are there to guide students in course registration requirements. Student advisers are there to monitor students’ association activities. Course lecturers whose expertise and fresh perspectives are invaluable to our community, and available all the time in virtual and physical classrooms for teaching and learning. Staff at the Dean’s Office are approachable and responsive to any inquiries. We are all here to serve you. I encourage you to take advantage of the many opportunities available in our faculty. We are fully aware that, as students, your prime time in life mostly happens during the period of your degree programme spent with us. It is during this time that you can make or unmake yourself. That is why we are committed to guiding you and letting you realise your full potential.  Once again, I welcome you to the Faculty of Arts. I look forward to welcoming you to our faculty. Professor Abdul Kabir Hussain SolihuDean, Faculty of Arts The Faculty of Arts, formally known as the College of Humanities, Management and Social Sciences, is one of the six pioneer colleges at the inception of the University in 2009. It was under late Professor Francis Abiola Irele who served as the pioneer Provost from 2009 to 2014, and later by Professor Sakah Mahmud as the second Provost between 2014 and 2019. The current Dean of the faculty is Professor Abdul Kabir Hussain Solihu from 2019 till date and Dr. Aliyu Okuta Ahmad as Sub-Dean from 2020 till date. Following the University’s decision to change from a collegiate management system to a faculty management system in 2020, the college was renamed the Faculty of Humanities, Management and Social Sciences. Over the last 14 years, it has continued to grow and thrive to become the largest faculty in the University in terms of student enrollment and number of academic staff, with 21 accredited undergraduate programmes. In June 2023, the faculty was split into the Faculty of Arts and Faculty of Management and Social Sciences.  Several staff in the faculty are currently holding critical administrative positions in the university. These include the Dean of the School of Postgraduate Studies, Dean of Student Affairs, Director of the Centre for Archives and Documentation, Director of University Relations, Director of Affiliation and Linkages, Director of the Centre for Advance and Basic Studies, and most importantly the Acting Vice Chancellor of the university.  The Faculty of Arts offers programmes guided by the philosophy of creating and developing responsible global citizens who play their role in community development and nation-building. Inspired by the University’s aspiration to become a world-class University, the Faculty produces graduates who could compete favourably with graduates of other universities anywhere in the world. In addition to teaching core courses in the disciplines and programmes offered, the faculty offers some General Studies courses (GNS), such as Use of English and Foreign Language Option (Arabic and French) meant to broaden students’ knowledge and perspectives of the global community through liberal education. Currently, the faculty has 12 full professors, 6 associate professors and 12 senior lecturers on permanent or contract appointment. Others are on lecturer I cadre and below in various departments. Several other professors and senior lecturers serve in the faculty through sabbatical, visiting or adjunct appointments. Our faculty members are experts in their respective fields and provide high-quality instruction to our students. They are engaged in professional training, quality research and scholarly publication in national and international outlets. Our academic and non-academic activities are designed to contribute to our student’s personal and professional growth. Our graduates are highly valuable and work in several private and public sectors. Site Visits – Department of Arabic and French Site Visits – Department of English and Linguistics Site Visits – Department of Fine and Applied Arts Site Visits – Department of Performing Arts and Film Studies Site Visits – Department of Religions, History and Heritage Studies The faculty has in the past years thrived and is still working hard towards attaining excellence in the areas of research, teaching, and developing skills and academic aptitude in our students. These efforts have resulted in the following: Hosting the KWASU Humanities Lecture series in which prominent and renowned scholars shared their experiences with academics in the faculty. The series included:   E-mail Address: Abdulkabir.solihu@kwasu.edu.ngPhone Number: +2348036117643 Research Interest/Specialisation: Islamic Thought, Comparative Religion, Religion and Ecology, Qur’anic StudiesEducational Qualification: B.A. (Al-Azhar University, Cairo); M.A., Ph.D. (IIUM, Malaysia). Membership of Professional Bodies: i. Nigerian Association for the Study of Religions (NASR)ii. Nigeria Association of Teachers of Arabic and Islamic Studies (NATAIS) iii. Nigerian Environmental Society iv. Malaysia Biodiversity Experts  E-mail Address: aliyu.ahmad@kwasu.edu.ngPhone Number: Not AvailableResearch Interest/Specialisation: Theoretical linguistic, Sociolinguistics, Historical linguistic and TranslationEducational Qualification: B.A., M.A (Ilorin); Ph.D (A.B.U. Zaria). Membership of Professional Bodies: i. Member: Nigeria Association of Teachers of Arabic and Islamic Studies (NATAIS) ii. Academic Society for Arabic Literature in Nigeria (ASALLIN). E-mail Address: abdulrasaq.dauda@kwasu.edu.ngPhone Number: +2348039308602Research Interest/Specialisation: Not AvailableEducational Qualification: B.Sc. (BUK). Membership of Professional Bodies: i. Member of the Nigerian Institute of Management. E-mail Address: sulyman.abdullah@kwasu.edu.ngPhone Number: +2347036763589Research Interest/Specialisation: Not AvailableEducational Qualification: HND (Kwara State Polytechnic). Membership of Professional Bodies: i. Not Available E-mail Address: ameenat.abdrahman@kwasu.edu.ngPhone Number: +2348063175181Research Interest/Specialisation: Not AvailableEducational Qualification: B.Sc. (Imo State University). Membership of Professional Bodies: i. Not Available E-mail Address: adeshinablessing7@gmail.comPhone Number: +2348066769843Research Interest/Specialisation: Not AvailableEducational Qualification: ND (Kwara State Polytechnic). Membership of Professional Bodies: i. Not Available"
    },
    {
        "content": "Faculty of Education was one of the pioneering Faculties established from the inception of the University in 2009. The faculty formally started as a College in Malete Campus in 2009 with four programs namely; Business Education, Early Childhood and Primary Education, Human Kinetics and Health Education, and Special Education. The pioneer Provost was Prof. N.B. Oyedeji and he managed the faculty for one year (2009-2010). Prof. Mohammed Gambari took over from Prof. Oyedeji in 2010 and administered the College from 2010 to 2020. The College was renamed Faculty of Education by the late Vice Chancellor, Prof. Muhammed Akanbi, SAN. Prof. Titus A. Umoru was appointed as the Dean in 2020 and he is currently administering the faculty. Site Visits – Business and Entrepreneurship Education Site Visits – Early Childhood and Primary Education Site Visits – Human Kinetics and Health Education Site Visits – Special Education Site Visits – Educational Management Site Visits – Arts and Science Education"
    },
    {
        "content": "It is my pleasure to welcome you to our faculty, the Faculty of Information and Communication Technology. The faculty is a knowledge house for 21st-century computer scientists, mass communicators, and professional librarians. We have a cream of committed academics honed with empirical and cutting-edge research skills who are working hard to train manpower for a competitive and ICT-driven knowledge economy. Our enthusiastic students find in our academic staff commitment and excellent service delivery that is unparalleled. Our learner-friendly classroom environment, teaching laboratories, and studios are equipped to give students industry-ready skills that make them highly sought-after graduates. Thus, as you tour our site, we invite you to savour our unique programmes and educational services. Contact us on any of our research that may be of interest to you and what you do.  Thank you for visiting our site. Please share with us your experience, suggestions, or advice. Professor. Isiaka Zubair Aliagan,Dean. The Faculty of Information and Communication Technology (previously College of Information and Communication Technology) is one of the foundation colleges/faculties in Kwara State University, which took off in the 2009/2010 academic session. It started with two departments namely; Computer Science (which also ran the Library and Information Science discipline) and Mass Communication. In 2011, the Library and Information Science Department was created out of Computer Science. The foundation Provost of the college was Professor Innocent Okoye (2009-2017) who was succeeded by Professor Kazeem Alagbe Gbolagade. Site Visits – Departments of Computer Science  Site Visits – Library and Information Science Site Visits – Mass Communication Coming up soon…   2023 Faculty Workshop The Faculty of Information and Communication Technology (ICT), Kwara State University (KWASU), Malete, held its first and second Faculty Workshop Series for the 2022–2023 Academic Session as part of efforts to improve the capability of its employees. Dr. Rasaq Adisa, a Sabbatical Senior Lecturer with the Department of Mass Communication, presented the first workshop on Thursday, February 9, 2023, on the subject of “Qualitative Research Paradigm, Data Management, and Analysis Using Nvivo Software,” and the second workshop for the 2022–2023 academic session was held on Wednesday, June 14, 2023. Professor Abdulwahab Olanrewaju Issa, a sabbatical professor in the Department of Library and Information Science, served as the resource personnel for this. “The Place of Academic Culture and Mentorship in the University System: A Librarian Perspective” was the title of his talk. After the first faculty workshop, a research committee was established under the headship of Professor Abdulwahab Issa of the Department of Library and Information Science. The Committee will suggest research topics and presenters for upcoming Faculty workshops.   First Edition of FICT Bulletin The Faculty of Information and Communication Technology Bulletin’s first issue was published in February 2023 in collaboration with the National Association of Information and Communication Technology Students (NAICTS). The 8-page bulletin covered a variety of topics, including events at the institution, Malete, and Environ.    FICT Under CCTV Coverage  To increase safety in the faculty area and to effectively monitor and invigilate exams, Closed-Circuit Television (CCTV) was installed across the Faculty of Information and Communication Technology. This project was in collaboration with the National Association of Information and Communication Technology Students (NAICTS). The CCTV cameras were set up, among other places, in the faculty’s front and back entrances, hallways, and exam rooms. By the 2023–2024 academic year, the faculty hopes to have complete CCTV surveillance in every classroom. KJICT Journal The faculty journal, KWASU Journal of Information, Communication, and Technology (KJICT) will soon publish its first issue. It is a peer-reviewed, high-quality, twice-yearly publication for academics and researchers in all fields of mass communication, computer science, engineering, information science, library science, statistics, and telecommunication science. KJICT promotes the exchange of original and current, grant-based research, literature reviews, and practical developments protected by copyright. KJICT is to be published in June and December each year.  Cash Prizes for Faculty Scholars The procession and presentation of cash prizes to student scholars selected from the three departments that made up the faculty were some of the major highlights of the Faculty Orientation programme held on Wednesday, February 1, 2023. The gesture, according to the acting dean, Dr. Isiaka Zubair Aliagan, was made to encourage healthy academic rivalry and to increase students’ enthusiasm for learning and academic performance. E-mail Address: Isiaka.aliagan @kwasu.edu.ngPhone Number:+2348033788999 Research Interest/Specialisation: Print Journalism, Press and Politics, Social and Digital Media, New Media Technology, Newspaper Political Economy Educational Qualification:  Membership of Professional Bodies: i. Member, Advertising Practitioners Council of Nigeria (APCON) ii. Member, International Press Institute (IPI) iii. Member, Association of Communication Scholars and Practitioners Association of Nigeria (ACSPN) iv. Member, African Council for Communication Education (ACCE) and v. Others   E-mail Address: funsho.idris@kwasu.edu.ngPhone Number: Not Available For Now... Research Interest/Specialisation: Not Available for Now...Educational Qualification:  B.Sc. Sociology Membership of Professional Bodies: i. Not Available For Now... E-mail Address: Not Available For Now...Phone Number: Not Available For Now...Research Interest/Specialisation: Not Available For Now...Educational Qualification:  B.A. English Membership of Professional Bodies: i. Not Available For Now... E-mail Address: Not Available For Now...Phone Number: Not Available For Now...Research Interest/Specialisation: Not Available For Now...Educational Qualification:  B.Sc. Political Science Membership of Professional Bodies: i. Not Available For Now... E-mail Address: Not Available For Now...Phone Number: Not Available For Now... Research Interest/Specialisation: Not Available For Now...Educational Qualification:  OND Membership of Professional Bodies: i. Not Available For Now..."
    },
    {
        "content": " Site Visits – Department of Business and Private Law Site Visits – Department of Jurisprudence and Public Law"
    },
    {
        "content": "I am delighted to welcome all students, staff, parents, guardians, and friends of the faculty to the web page of the Faculty of Pure and Applied Sciences, Kwara State University, Malete. Our faculty seeks to be a leading figure in research, innovation, community service and entrepreneurship. We have a robust and experienced teaching and technical staff committed to producing excellent students in various fields of science. Our programmes are unique, robust, current, and comparable to the best in the world. The faculty offers outstanding undergraduate (B. Sc.) and graduate (PGD, M.Sc., Ph. D) degree programs. Our graduates currently work in universities, research institutes, industries and with government agencies nationally and internationally. The Faculty of Pure and Applied Sciences was established as one of the foundation colleges with the inception of Kwara State University, Malete in 2009. The faculty started with three (3) Departments, namely Biosciences and Biotechnology, Chemical, Geological and Physical Sciences and Mathematics and Statistics. From this modest beginning and with just a few students and a few staff, the faculty has grown to become a leading centre for teaching, research and community development. The faculty is presently made up of nine (9) departments with over 6,000 regular students and offers undergraduate and graduate degrees in eleven (11) programmes that are all fully accredited by the National University Commission. At its inception, Prof. Deboye Kolawole served as the foundation provost of the College of Pure and Applied Sciences. Other past provosts of the College include Prof. Silas Dada, Prof. Adebayo Olaniyi Aina and Prof. Adebayo A. Oladimeji. The current Dean is Emmanuel Oladipo Ajani, a professor of Biochemistry. Our staff conducts research comparable to the standard obtainable internationally and our research is focused on solving global environmental, industrial and nutritional challenges, understanding diseases and developing new drugs, advancing technologies, analysing data and much more. Our staff strength includes over one hundred (100) academic staff and thirty-one (31) technical staff. According to the Community development vision of Kwara State University, we emphasize nurturing the entrepreneurial skills of our students within their disciplines. With our industrial training programme, which is an essential component of our curriculum, our students are well prepared to meet the increasingly complex needs of the future. Site Visits – Biochemistry Site Visits – Chemistry and Industrial Chemistry Site Visits – Department of Environmental Management and Toxicology Site Visits – Department of Geology and Mineral Science Site Visits – Department of Mathematics and Statistics Site Visits – Department of Microbiology Site Visits – Department of Physics and Material Sciences Site Visits – Department of Plant and Environmental Biology Site Visits – Department of Zoology Coming Up Soon… Faculty Lecture On 21st March 2021, the faculty held the maiden edition of the annual Faculty of Pure and Applied Sciences lecture series. The faculty lecture was conceived to cultivate a stronger academic atmosphere at Kwara State University by showcasing the scholarly activities of renowned academics. The faculty lecture serves as an annual intellectual rallying point for scholars, students, and the public by drawing eminent scholars from around the globe to KWASU to engage in intellectual conversation and discourse. The lecture series showcases and promotes excellence in science and provides rich opportunities for students, faculty staff and the public to listen to internationally renowned scholars as they address important issues in science. The lecture topics are carefully selected to address scientific issues of the day and provide the right forum to discuss advancement in science. In 2022, the lecture was renamed “Professor Musbau Akanji, Annual Faculty of Pure and Applied Sciences Lecture” and an endowment programme was thereafter instituted to ensure that the lecture is held in perpetuity. Past guest lecturers are Professor Abel Idowu Olayinka (former Vice-Chancellor, University of Ibadan) who gave a lecture on “New Frontiers in 3D Geological Mapping and Implications for Solid Mineral Development in Nigeria”. Professor Musbau Akanji, FAS (a two times Vice-Chancellor) delivered the 2022 Annual Lecture that was titled “Role of Science, Technology and Innovation in National Development: Any Hope for Nigeria in This 21st Century?” The 2023 Annual lecture was titled “Leveraging on participative global treaties and strategies – imperatives for pollution control and sustainable development” and was delivered by distinguished Professor Babajide I Alo FAS, from University of Lagos. Hands-on training on The Use of Laboratory Equipment Recognizing the fact that laboratory equipment plays a paramount role in the training of graduates of science, the faculty on Wednesday, 28th July 2021, organized a hands-on-training capacity building programme on the use and application of laboratory equipment. The training programme which attracted participants from across faculties in the Kwara State University was designed to strengthen the technical know-how of the academic and technical staff of the faculty and other university staff for a better teaching and research output. Facilitators for the training programme were drawn from universities and Research Institutions in Nigeria. Staff Seminar On 22nd February 2022, the faculty kickstarted a monthly staff seminar series. The staff seminar is targeted at ensuring a proper flow of knowledge and assisting in passionate interaction among our staff, thereby boosting the skills and expertise of our faculty. It is also designed for members of the University community, the industry, research institutes and the public to engage and strengthen collaborations. The seminars showcase the scholarly activities of faculty selected across the existing disciplines and by it, the lecturers share the enthusiasm and dedication that sustains their creative efforts.   Research Clusters Towards deepening research culture and enhancing research collaborations among faculties and across departments, the faculty established five (5) research cluster groups each headed by a professor. The mission of the cluster groups includes promoting the translation of research output into product development, facilitating research collaborations with industries, and promoting annual research exhibitions. Each of these cluster groups has a mandate to develop research proposals and seek to attract research grants to the university.   Inaugural &Valedictory Lecture Presentation Two members of the faculty, Professor Emmanuel Oladipo Ajani (Dean) and Professor Sunday Awe (HOD, Microbiology) presented the 9th and 11th (respectively) Inaugural lectures of Kwara State University. A faculty member, Professor Adebayo Oladimeji also presented the first valedictory lecture at Kwara State University. E-mail Address: emmanuel.ajani@kwasu.edu.ngPhone Number: 08055533192Research Interest/Specialisation: Phytopharmacology, Phytomedicine, Toxicology and Natural product Educational Qualification:  Membership of Professional Bodies: i. American Society of Biochemistry and Molecular Biology (ASBMB) ii. Nigerian Society for Biochemistry and Molecular Biology (NSBMB) Society for Conservation and Resource Development of Medicinal Plants (SMP) Western African Network of Natural Products Research Scientists (WANNPRESS) iii. International Society of Organic Agricultural Research E-mail Address: abdulazeez.jimoh@kwasu.edu.ngPhone Number: 08035768758 Research Interest/Specialisation: Numerical Analysis and Computational MathematicsEducational Qualification:  Membership of Professional Bodies: i. Member, Science Association of Nigeria ii. Member, Mathematical Association of Nigeria  iii. Member, Nigerian Mathematical Society iv. Member, Nigerian Association of Mathematical Physics E-mail Address: abdulkadir.lateefat@kwasu.edu.ngPhone Number: 08061506631 Research Interest/Specialisation: Not Available For Now...Educational Qualification:  Membership of Professional Bodies: i. APSSON E-mail Address: hamid.abdulquadir@kwasu.edu.ngPhone Number: 08068204660 Research Interest/Specialisation: Not Available For Now...Educational Qualification:  Membership of Professional Bodies: i. ANUPA E-mail Address: falilat.wahab@kwasu.edu.ngPhone Number: 08103428052 Research Interest/Specialisation: Not Available For Now...Educational Qualification:  B.Ed. Educational Management Membership of Professional Bodies: i. ANUPA E-mail Address: habeekam@gmail.comPhone Number: 08035439290Research Interest/Specialisation: Not Available For Now...Educational Qualification:  B.Sc. Arabic Language Membership of Professional Bodies: i. Not Available For Now... E-mail Address: bolanlejuliet1990@gmail.comPhone Number: 08035439290Research Interest/Specialisation: Not Available For Now...Educational Qualification:  B.Sc. Arabic Language Membership of Professional Bodies: i. Not Available For Now..."
    },
    {
        "content": "Grantsmanship and research proposal writing workshop: the KWASU experiment.  KWASU Research Team Wins Ten Million Naira NRF Grant A team of researchers led by Professor Gbolagade Kazeem Alagbe of the Department of Computer Science, Faculty of Information and Communication Technology has won ten million Naira grant from the National Research Fund NRF. The notice of the grant which was contained in a letter addressed to the Vice Chancellor of Kwara State University and signed by the Executive Secretary of Tertiary Education Trust Fund TETFund said the project titled “On Residue Number System Based Processor’s Realization” won the sum of Ten Million Naira being 100% of the Total Intervention Cost (TIC). The letter added that “the Research Grant is to enable your Institution and Researcher(s) contribute meaningfully to Government’s desire to revive and make Research and Development the launch pad of National Development”. In his response at receiving the letter, the Acting Vice Chancellor of Kwara State University, Professor Shaykh Luqman Jimoh lauded Professor Gbolagade Kazeem Alagbe and his team for the feat which the Acting Vice Chancellor described as bringing positive attention and laurel to the University. Professor Jimoh noted that winning research grants was one of the ways of confirming the staff quality and research prowess of institutions adding that this latest grant-winning success was gladdening as it proved that the staff of the University was among the high-flying researchers who were contributing to innovative thoughts and national development. While congratulating the team, he urged them to ensure that they followed laid down research ethics and abide by the conditions of the grant-awarding institution. Dr. Saeedat AliyuAg. Director, University Relations  KWASU Staff Makes Wave: Wins £6000 Rufford Foundation Grant Dr. Segun Olayinka Oladipo of the Department of Zoology, has won The Rufford Foundation Grant of six thousand Pounds. Notice of the grant which was addressed to the University and signed by the Chief Executive Officer of the Foundation, Stuart Paterson, said the grant is in support of a project to intensify conservation actions for the protection of Red List Threatened stingrays in Nigerian Lagos Lagoon. Commenting on the award, the Acting Vice Chancellor, Professor Shaykh Luqman Jimoh congratulated Dr. Oladipo on winning the grant stating the importance of extending expertise to the conservation of nonhuman nature. The Acting Vice Chancellor noted that the ensuring the survival of other nonhuman biotic constituents of nature was needed for humans to also thrive. Professor Jimoh charged the awardee to redouble his efforts in the execution of the project and urged him to continue to bring greater laurels and recognition to the University. Dr. Oladipo holds first, second and third degrees in Zoology from the Universities of Ilorin and Ibadan. His current research interest mainly focuses on the use of morphological and molecular data (DNA barcoding) in species identification and the integration of molecular and ecological data to understand how best organisms respond to varying environmental conditions. He has won many international grants on wildlife biology and conservation from the National Geographic Society, Rufford foundation, Save Our Seas, PADI common grants among others. Dr. Oladipo has worked in over 10 water systems including Nigeria coaster water; India Ocean in Mombasa, Kenya; Pacific Ocean in San Fransico, USA; and 5 protected areas in Nigeria, including areas designated by the United Nations as World’s Heritage sites. Most recently, his expedition to Nigerian coaster water resulted in the updating of the documentation of Nigerian endangered rays and presently, he is working on the “Diversity, Distribution and community-based conservation of the marine fish communities in Nigerian Lagos Lagoon using eDNA” using National Geographic Society grant and “Intensifying conservation actions for the protection of Red List Threatened stingrays in Nigerian Lagos Lagoon” through a 2nd Rufford foundation grant. Dr. Saeedat AliyuActing Director, University Relations  KWASU Wins 12.5 Million Naira Research Grant Researchers from Kwara State University, Malete, have won the TETFund National Research Fund grant worth twelve and a half million Naira. The Acting Vice-Chancellor, Professor Shaykh-Luqman Jimoh received a letter notifying the University of the award from the institution’s Director of Center for Research and Development, Professor Olawale Moshood Aliyu on Monday April 17, 2023. The letter which was addressed to the Vice-Chancellor and signed by the Executive Secretary of TETFund, Arch. Sonny T. Echono stated that the grant was awarded under the 2021 NRF Intervention. According to the letter the research will be conducted by a team of Researchers led by Dr. Olayinka Jelili Yusuf with the title “Influence of Cultural and Demographic Attributes on the Spread and Containment of Coronavirus Pandemic in Nigeria”.  KWASU Scholar Wins $24,000 Cad International Scholarship Grant Dr. Rashidat Akande of the Department of Economics and Development Studies, Kwara State University has won a $24,000 CAD International Scholarship Grant of the Queen Elizabeth Scholarship – Advanced Scholars – West Africa (QES-AS-WA) scheme. Dr. Akande won the QES-AS-WA scholarship award under the year 2022 with the theme “Wurin ta na yin rubutu – Her own room to write”. Dr. Akande’s participation in the programme is for 2 months and is aimed at supporting women Ph.D.s and early career researchers to expand the frontiers of their research and create lasting impact both in Nigeria and Canada.  KWASU wins 3 TETFund NRF Grants totalling N67m Three research teams from Kwara State University have won the 2023 cycle of grants from the National Research Fund NRF. In a reception to present the letters of award and recipients to the management of the University at the Council Chamber on Monday, January 29, 2024, the Acting Vice-Chancellor, Professor Shaykh-Luqman Jimoh, described the wins as achievements for the institution. Professor Jimoh noted that the profile of the University was growing significantly with the constant research grant winning successes by the staff, and urged more staff to showcase their abilities by winning national and international grants to the institution. The Director of the Centre for Research and Development, Professor Olawale Moshood Aliyu, commended the management of the institution for investing in the training of staff in grant writing which he said is now yielding dividends. Professor Aliyu added that this current success was evidence that the second goal of the University’s strategic plan which centres on research excellence was being met. He said plans were underway to enhancing the skills of more staff in writing award winning research proposals. Present at the event were the management staff of the University, Deans, Heads of Departments, Directors of Centres, and the team members which won the grants. Highpoint of the event was the presentation of the letters to the principal investigators, Dr. Falilat Jumoke Ajao, Dr. Wasiu Awoyale, and Dr. Monsurat Omolara Balogun."
    },
    {
        "content": "Kwara State University (KWASU), Malete, is an institution of higher learning owned by the Kwara State Government, Nigeria. It is a university which has attained a prominent position in the comity of universities in Nigeria. KWASU began academic operation in October 2009 with lectures starting in December 2009. There were five hundred and fifty (550) students in the five (5) Colleges: The faculty of Engineering and Technology was established in 2010 as the sixth faculty. The University then changed from the collegiate system to faculties in 2019 while the faculty of Law, the seventh faculty, was accredited by both the National Universities Commission (NUC) and Council for Legal Education in 2020. The University started postgraduate programmes during the 2014/2015 academic session with the establishment of the School of Postgraduate Studies. The faculty of Basic Medical Sciences commenced activities in 2022 following the requisite approval from the NUC. In March 2023, the faculty of Humanities, Management and Social Sciences was unbundled to create the faculties of Arts and that of Management and Social Sciences. In 2024, the faculty of Allied Health Sciences was created out of the faculty of Basic Medical Sciences and in the 2024/2025 academic session, the faculty of Environmental Sciences came on board and is sited in the Osi campus, thus bringing the number of faculties to 11. The University has graduated twelve (12) sets of first-degree graduates and six (9) sets of postgraduate students. Overall, KWASU has a rich history of academic excellence and a bright future ahead. We are proud to be a leader in higher education in Nigeria and are dedicated to helping our students succeed."
    },
    {
        "content": " Professor Dupe Olufunke Ogunbosoye delivered the 17th Inaugural Lecture on Wednesday, November 27, 2024, titled: The Ruminants: Exploring their Intrinsic and Extrinsic Treasures.  Professor Oluremi Mabel Awogbade delivered the 16th Inaugural Lecture on October 23, 2024, titled “Nurturing Creative Minds: Child Development, Art Education, and National Development”.  Professor Ibrahim Laro Abubakar 14th Inaugural LectureJuly 10, 2024“Man’s Limitation of himself against the Potentials and Gifts from his Creator: A Psychological Perspective”  Professor Abiodun Amuda-Kannike SAN14th Inaugural Lecture May 8, 2024“The Jurisprudence of Our Constitution, Rule of Law and Technicalities: The Nigerian Dilemma”  Professor Christianah Dada January 31, 202413th Inaugural Lecture “Despondency, Despair and Hope: Tales of Intellectual Disability in Special Needs Education”  Professor Bilyamin Adeoye Ibitoye, 12th Inaugural Lecture July 12, 2023 “Living with Death Trap: Way Forward to Safer Life on Nigerian Roads”  Professor Sunday Awe 11th Inaugural LectureMay 20, 2023 From the Field to the Bottles: Works of Invicible Creatures”  Professor Titus A. Umoru10th Inaugural LectureJanuary 18, 2023“Business Education and Technology: Unlocking the Potentials of Man for Sustainable National Development”  Professor Emmanuel Ajani9th inaugural lectureMay 18, 2022“Man versus Diseases: The Green Remedy”  Professor Abdulrauf Ambali8th Inaugural LecturerApril 27, 2022 “Administration and Governance at the Brink of Collapse: A Search for the Root Cause and Ways to Reposition the System”  Professor David Friday Apata7th Inaugural LectureJanuary 19, 2022 “Feed is Good, Toxicants the Bane”  Professor Olawale Moshood Aliyu, on November 13, 2019, delivered the 6th Inaugural Lecture titled “Decoding the Secret of Life: Plant, Sex and Sustainable Food Production”  Engr. Professor Abdulganiyu Funsho Alabi FNSE, the 5th Inaugural Lecturer, delivered his lecture “Striving for Global Relevance on the Platform of Minerals, Metals and Materials” on March 27, 2019.  Professor Hazmat Ishola Abdulraheem, the 4th inaugural lecture on November 21, 2018, titled his lecture “Nigerian Literature in Arabic: Concept, Content and Contributions to National Development”.  Professor Kazeem Alagbe Gbolagade, the 3rd Inaugural Lecturer on March 5, 2018, delivered the lecture titled “Just for the Love of High Speed Processors”.  Professor Sakah Saidu Mahmud delivered the 2nd inaugural lecture titled “Democracy in Nigeria at The Crossroads: The Good, the Bad and the Ugly” on November 22, 2017.  Professor Leonard F. Daniel delivered the 1st Inaugural Lecture of Kwara State University on May 3, 2017, titled “Aeronautics and Astronautics: The Paradigm Shift in Nigeria’s Future Space Exploration and Development”"
    },
    {
        "content": "Admission Into KWASU Sandwich Degree Programmes Available Courses for the Four (4), Five (5) and Six (6) Year Programmes Duration of Programmes Admission Requirements 1.SIX- contacts Programmes: 2. FIVE- contacts Programmes: 3. FOUR- contacts Programmes: 4. TWO-contacts PGDE: Minimum of 2 and Maximum of 3 contacts for the two-contact programme. The Post Graduate Diploma in Education (PGDE) is designed for Bachelors, Master’s and Ph.D. degree holders willing to be qualified as a Professional Teacher. All Lectures hold at KWASU International Conference Centre, Ilorin, Kwara State Nigeria between the months of July and September each year. Substantial appreciation awaits canvasser that brings/supplies candidates for any or all of the programmes. How to Apply: Online application is available for a fee of N10.000.00 only. For further details, please contact the Director on 08034468438 Prof. Olubukola Christianah Dada Director Apply Now  "
    },
    {
        "content": "LexScriptio – Journal of Department of Jurisprudence & Public Law, Faculty of Law, Kwara State University, Malete. Journal of Discourse in Language and Literature (JODILL). Technoscience – Journal for Community Development in Africa"
    },
    {
        "content": "Kwara Governor appoints Prof. Jimoh as KWASU VC Kwara State Governor AbdulRahman AbdulRazaq CON, on Tuesday, June 11, 2024, named Professor Shaykh-Luqman Alade Jimoh as the substantive Vice-Chancellor of Kwara State University (KWASU). A statement signed by the Governor’s Chief Press Secretary, AbdulRafiu Ajakaye, said the appointment followed the outcome of the screening exercise of the university’s governing council in which Professor Shaykh-Luqman Jimoh came first among the other candidates. Professor Jimoh, until his appointment, was the Acting Vice-Chancellor of the University, before which he was the Deputy Vice-Chancellor of the University between 2020 and 2022. The new Vice-Chancellor has many years of quality experience in teaching, research, administration, and community service, and comes highly recommended to the job as helmsman of a dynamic institution like Kwara State University. His tenure as Acting Vice-Chancellor saw the University taking strides that have entrenched the name of the institution as a front line University in Nigeria and beyond. Professor Jimoh is an international scholar of Islamic studies whose multidisciplinary contributions cut across medicine, psychology, economics, sociology, language, and politics. He is a recipient of several academic honours such as being the Best Graduating Student of the Department of Religions in 1988 from the University of Ilorin; the University Undergraduate Scholarship Award (1987/1988); and University Scholar 1987/1988). He is a Fellow/member of many professional bodies such as Chartered Institute of Public Diplomacy and Management and Council of Experts for International Centre on Contemporary Research in Islamic Sciences (United Kingdom). With this appointment, Professor Shaykh-Luqman Alade Jimoh has become the 3rd substantive Vice-Chancellor of the Green University for Community Development and Entrepreneurship, Kwara State University. Ijmb Your email address will not be published. Required fields are marked *  Save my name, email, and website in this browser for the next time I comment.  \n\n Δ Search Categories"
    },
    {
        "content": "KWASU our great Institution\n\nThe Citadel of learning in Malete\n\nWith skills, innovation and integrity\n\nWe will expand, the frontiers of knowledge\n\nIn harmony, we shall attain the peak of scholarship\n\nLighting up the world with your legacies\n\nKWASU, our Alma Matar! We shall build a World Class\n\nKwara State University!\n\nWith determination we shall learn\n\nThrough aspiration and inspiration\n\nWe will be empowered\n\nDeveloping our community and\n\nAdvancing humanity\n\nDeveloping our community and\n\nAdvancing humanity\n\nKWASU KWASU\n\nYour seed shall ever sing your praise\n\nKWASU KWASU\n\nYour seeds shall ever sing your praise.\t\t\t\t\t"
    },
    {
        "content": "KWASU among Six Institutions Selected for ICT Experience Centre Kwara State University, KWASU, Malete, has been selected as one of the six pilot universities for the Tertiary Education Trust Fund, TETFund, and Office of the First Lady establishment of ICT Experience Centres in public tertiary institutions in Nigeria. The information regarding the selection of KWASU as a pilot institution was contained in a letter to the Vice-Chancellor, Professor Shaykh-Luqman Jimoh, and signed by the Executive Secretary of TETFund, Architect Sonny S.T. Echono. The letter stated that the Tertiary Education Trust Fund, in collaboration with the Office of the First Lady, is championing the establishment of ICT Experience Centres in furtherance of the joint initiative of the Federal Ministry of Education and Federal Ministry of Communication, Technology, and Digital Economy Learn to Earn Programme. It added that the project, which is part of the Renewed Hope Agenda of the Federal Government, aims to provide undergraduates with tailored technological education and opportunities to thrive in the digital era. “The primary objective of the ICT Experience Centres is to empower undergraduates and institutions of learning with skills, infrastructure, and mindset necessary to excel in a digitally driven world. “Your Institution has been chosen for the first phase/pilot programme of this initiative”, it added. 6 pilot ICT Experience Centres, one in each geopolitical zone of the country, constitute the pilot stage. Reacting to the development, the Vice-Chancellor of Kwara State University, Professor Shaykh-Luqman Jimoh, described the selection of KWASU as elating and indicative of the strategic positioning of the institution as a hub for the training of 21st century individuals who contribute significantly to national development. I want to come to kwasu Kwasu aspirant Your email address will not be published. Required fields are marked *  Save my name, email, and website in this browser for the next time I comment.  \n\n Δ Search Categories"
    },
    {
        "content": "KWASU Update Download June 2021 Update Download August 2021 Update Download September 2021 Update Download December 2021 Update  Download  March 2022 Update Download April 2022 Update Download July 2022 Update Download September 2022 Update Download October 2022 Update Download November 2022 Update Download January 2023 Update Download February 2023 Update Download March 2023 Update Download February 2024 Update Download March 2024 Update Download"
    },
    {
        "content": "Studying at KWASU can be a vibrant and exciting experience for students. It is an opportunity to be a part of a diverse community of people with different backgrounds, interests, and goals. One of the most appealing aspects of campus life is the social aspect. Students have the opportunity to make new friends and connections with their peers through a variety of activities, clubs, and organizations. These can range from academic clubs and organizations, such as a pre-med society or debate team, to more recreational clubs, such as a hiking club or ultimate frisbee team. In addition to social activities, campus life often includes a wide range of cultural and educational events. These can include guest lectures, concerts, theater performances, and art exhibits. These events allow students to broaden their horizons and learn about new subjects and ideas. Another important aspect of campus life is the opportunity to get involved in service and leadership opportunities. Many colleges offer service-learning courses, in which students can work on projects that benefit their communities and gain valuable experience. "
    },
    {
        "content": "Welcome to the Faculty of Management and Social Sciences (FMSS) at Kwara State University, Malete! I am deeply honoured to serve as the Dean of this vibrant and dynamic faculty. FMSS currently hosts five departments, including the Department of Accounting and Finance, Department of Business and Entrepreneurship, Department of Economics and Development Studies, Department of Politics and Governance as well as the Department of Tourism and Hospitality Managements. Here at FMSS, we are committed to excellence in Management and Social Sciences education, research, and community engagement.Our faculty comprises a diverse community of students, faculty members, and staff who are dedicated to making a positive impact on society. I invite you to explore our website further to learn about specific information on the programs we offer, the remarkable achievements of our faculty and students, and the impactful research taking place within our walls. Whether you are a prospective student, a current member of our community, or a visitor interested in our work, we hope you find valuable insights and resources here.Thank you for choosing FMSS at Kwara State University, Malete, as your academic and intellectual home. Together, we will strive for excellence, innovation, and positive change. We look forward to having you join us on this exciting journey of learning, discovery, and growth. Dr. Shehu Usman AdamDean, Faculty of Management and Social SciencesKwara State University, Malete. The Faculty of Management and Social Sciences (FMSS) at Kwara State University, Malete, has a rich and storied history that reflects our commitment to academic excellence and societal impact. FMSS was founded with the vision of becoming a leading faculty in Management and Social Sciences education and research. In a significant development, our new journey began when the faculty was established as part of the defunct Faculty of Humanities, Management and Social Sciences (HMSS) which was one of the founding faculties at the inception of the university in 2009. FMSS emerged as a distinct faculty in 2023, following the unbundling of HMSS into FMSS and Faculty of Arts, orchestrated by the expansion of the hitherto existent faculty of HMSS both in terms of enrolment and degree programmes. This milestone marked a new chapter in our journey, allowing us to focus more intently on our core disciplines and to better serve our students and the broader community.Since our inception, FMSS has provided high-quality education, conducting cutting-edge research, and engaging with our communities to address real-world challenges. We take pride in our commitment to producing graduates who are not only academically proficient but also socially responsible, creative, and equipped to make a meaningful impact on society. As we continue to evolve and grow, we remain steadfast in our dedication to excellence, innovation, and the pursuit of knowledge. We look forward to a future filled with continued achievements, impactful research, and the success of our students and faculty members. Thank you for being part of our journey, and we invite you to explore FMSS at Kwara State University, Malete, as we continue to expand horizons through collaborations, foster critical thinking, and shape a brighter future. Site Visits – Department of Agricultural Economics and Extension Services Site Visits – Department of Animal Production, Fisheries and Acquaculture Site Visits – Department of Crop Production Site Visits – Department of Food Science and Technology Our achievements since establishment include inter alia; E-mail Address: Shehusman.adam@kwasu.edu.ngPhone Number: +2348088298353Research Interest/Specialisation: Environmental Economics and MicroeconomicsEducational Qualification:  Membership of Professional Bodies: i. Member, South African Society of Agricultural Extension E-mail Address: muraina.dauda@kwasu.edu.ngPhone Number: 08057649913/08965100672 Research Interest/Specialisation: Not Available For NowEducational Qualification:  Membership of Professional Bodies: i. Member, Association of Nigerian University Professional Administrators (ANUPA) ii. Member, Nigeria Institute of personnel Management (NIM) E-mail Address: sakashehu2010@gmail.comPhone Number: 0803-722-6817 Research Interest/Specialisation: Not Available For NowEducational Qualification:  Membership of Professional Bodies: i. Not Available For Now ii. Member, Nigeria Institute of personnel Management (NIM) E-mail Address: sulmora1@gmail.comPhone Number: 0803-855-3283 Research Interest/Specialisation: Not Available For NowEducational Qualification:  Membership of Professional Bodies: Not Available For Now E-mail Address: salleetesleem@kwasu.edu.ngPhone Number: 0818-586-2037Research Interest/Specialisation: Digital Economy & Data AnalyticsEducational Qualification:  Membership of Professional Bodies: i. ATSWA, Nigerian Economic Society E-mail Address: tawakalitubello@gmail.comPhone Number: 0813-118-6936Research Interest/Specialisation: MarketingEducational Qualification:  Membership of Professional Bodies: Not Available For Now E-mail Address: salamatbusari13@gmail.comPhone Number: 0703-255-5121Research Interest/Specialisation: Not Available For NowEducational Qualification:  Membership of Professional Bodies: Not Available For Now E-mail Address: lukman.oke@kwasu.edu.ngPhone Number: 08034305255Research Interest/Specialisation: Corporate Reporting and Development FinanceEducational Qualification:  Membership of Professional Bodies: "
    },
    {
        "content": "To be the fulcrum of knowledge-driven society, building competencies through creativity and cutting-edge technology. To be the foremost institution in expanding the frontier of knowledge."
    },
    {
        "content": " MLSCN Inducts 111 Newly Qualified Medical Laboratory Scientists at the 4th Oath – Taking/ Induction Ceremony in Kwasu One hundred and eleven (111), newly qualified Medical Laboratory Scientists were today, 29th March 2023, formally inducted into the Medical Laboratory profession. Four (4) students made first class honours and forty-three (43) students graduated in the second class upper division. Fifty-one students made second class lower with thirteen (13) students in the third class category.    KWASU Inducts 46 at 5th MLS Oath Taking/Induction Ceremony 46 newly qualified Medical Laboratory Scientists from the Kwara State University received their Provisional Licence to Practice from the Medical Laboratory Science Council of Nigeria, MLSCN, at the 5th Oath-Taking / Induction Ceremony held in Mini Convocation Arena of the University on November 29, 2023. Speaking during the ceremony, the Acting Vice Chancellor Professor Shaykh-Luqman Jimoh commended the achievements of the inductees and emphasised that their success was proof of KWASU’s unwavering commitment to academic excellence. He said the University was dedicated to training professionals that are equipped with the knowledge and skills to positively impact their respective fields. Professor Jimoh urged the inductees not to relent in their quest for more knowledge just as he stressed that their ability to improve on their professional skills will help them cope with the evolving challenges in the field of Medical Laboratory Science. The Registrar of the Medical Laboratory Science Council of Nigeria, Dr. Tosan Erahbor while hailing the efforts of the Management of the University to reposition the MLS programme through staff and facility upgrade, noted that producing qualified manpower requires significant investments. The Registrar, who was represented by the Director of Regulation and Discipline, Mrs. Funmilayo Onakalu, cautioned the inductees against unethical practice adding that there were abundant opportunities for success if they maintained ethical conduct. The Dean, Faculty of Basic Medical Sciences, Professor Salihu Ajao, also urged the inductees to be dedicated to their profession, he, stated that by adhering to professionalism in the course of their duties, they can contribute to the advancement of the healthcare system of the country. Out of the 46 inductees, 2 students made First Class Degrees with 12 in the Second Class Upper Division. 27 made Second Class Lower Degrees while 5 inductees were in the Third Class Division.   Prof. Jimoh congratulated the recipient adding that the award would motivate all members of the University to strive more for excellence. The Acting Vice Chancellor described Professor Babalola as an excellent scholar who was keen on contributing to society as exemplified by his continued service to educating the coming generation even after retirement. Professor David Babalola was born in Omu-Aran in Irepodun Local Government Area of Kwara State and attended schools in Ilishan-Remo in Ogun State, Michigan USA, Ile-Ife and Ibadan. He earned a B.A. Theology/History in 1973, B.A. History in 1976, M.A. History in 1977, Master of Divinity in 1979 and a Ph.D. in Church History in 1988. Professor Babalola attained the rank of Professor in 2004 and is the first from Kwara State to be appointed President of Seventh-day Adventist Church in Western States (which comprised Kwara, Kogi, Oyo, Ogun, Osun, Ekiti, Ondo and Lagos states). He is also the pioneer General Secretary of Seventh-day Adventist (SDA) Church in Nigeria and Senior Pastor for Babcock University, Ilishan-Remo. He served as the pioneer Deputy Vice Chancellor, Management Services at Babcock University, Ilishan-Remo before joining the services of Kwara State University where he currently heads the Christian Studies unit. Professor Babalola has many publications in both international and national outlets particularly on the history and administration of Seventh Day Adventists in Nigeria. He has also received many national and international awards before this honour by the Kwara State Government. Dr. Saeedat AliyuAg. Director, University Relations"
    },
    {
        "content": "Search Categories"
    },
    {
        "content": "Nigeria Society of Engineers NSE inducts Graduate Members of KWASU on Monday, December 16, 2024. Your email address will not be published. Required fields are marked *  Save my name, email, and website in this browser for the next time I comment.  \n\n Δ Search Categories"
    },
    {
        "content": "The basic objective of KWASU engineering is to educate the next generation of scientists, technologists, and engineers with the capability to solve real problems and provide leadership that could lead to the economic and social transformation of Kwara State, Nigeria, and the World at large.  As such, the goal is to promote a strong foundation in “the fundamentals”, a deep understanding of the research to extend the frontiers of knowledge within an interdisciplinary framework, and an orientation towards entrepreneurship and/or service that could lead to the continuous development of the graduates. At the undergraduate level, our goal is to provide the best and the brightest students with an interdisciplinary education, while preparing them for future leadership and success in the game of life. Every undergraduate student will be required to engage in community service (COBEP) and industrial attachment that will prepare them to work in the real world and proffer engineering solutions to community-based problems during the weeks of interaction.  Furthermore, the students will be required to undertake a two-semester-long final-year project that will develop their research competencies. Experienced and quality academic staff of the faculty are committed to innovative research that has an impact on society. Thus, they have impacted our alumni at both bachelor and post-bachelor degrees and these alumni are doing well in their chosen specialties. Therefore, a warm welcome is extended to all undergraduate and postgraduate students, industrial partners, ministries, departments, agencies of government, and international organizations. Professor A. G. F. Alabi FNSE, FMSN, SPX, Reg Engr. (COREN)Dean, Faculty of Engineering and Technology.Kwara State University, Malete Site Visits – Department of Aeronautics and Astronautics Engineering Site Visits – Department of Civil and Environmental Engineering Site Visits – Department of Electrical and Computer Engineering Site Visits – Department of Food and Agricultural Engineering Site Visits – Department of Materials Science and Engineering Site Visits – Department of Mechanical Engineering The faculty has carved its niche in the existing programmes by floating the various options relevant to the development of the community at both undergraduate and postgraduate levels. E-mail Address: abdulganiyu.alabi@kwasu.edu.ngPhone Number: NullResearch Interest/Specialisation: Didn't SpecifyEducational Qualification: Not Available For Now Membership of Professional Bodies: Not Available for now E-mail Address: morakinyo.kareem@kwasu.edu.ngPhone Number: Null Research Interest/Specialisation: Not Available For NowEducational Qualification:  Not Available For Now Membership of Professional Bodies: Not Available For Now E-mail Address: anladi.shehu@kwasu.edu.ngPhone Number: NullResearch Interest/Specialisation: Not Available For NowEducational Qualification: Not Available For Now Membership of Professional Bodies: Not Available For Now ii. Member, Nigeria Institute of personnel Management (NIM) E-mail Address: waheed.sunmon@kwasu.edu.ngPhone Number: NullResearch Interest/Specialisation: Not Available For NowEducational Qualification: Not Available For Now Membership of Professional Bodies: Not Available For Now E-mail Address: lawal.abdulkadir@kwasu.edu.ngPhone Number: NullResearch Interest/Specialisation: Digital Economy & Data AnalyticsEducational Qualification: Not Available For Now Membership of Professional Bodies: Not Available For Now E-mail Address: mashood.salman@kwasu.edu.ngPhone Number: NullResearch Interest/Specialisation: Not Available For NowEducational Qualification: Not Available For Now Membership of Professional Bodies: Not Available For Now"
    },
    {
        "content": "Welcome to Kwara State University’s postgraduate admissions page. We are excited to help you take the next step in your academic and professional journey. Our admissions process is designed to be as straightforward as possible. In this section, you’ll find everything you need to know about applying to Kwara State University for postgraduate studies. To begin the application process, you’ll need to create an account on our online application portal. This will allow you to submit your application, track its status, and receive important updates. To be considered for postgraduate admission, you’ll need to submit the following: At Kwara State University, we offer a wide range of postgraduate programs in various fields of study including: We encourage you to explore the different programs we offer to find the one that best aligns with your interests and career goals. Once we receive your application, our admissions team will review it to ensure that you meet our minimum requirements. If you’re accepted, you’ll receive an offer letter, which will include information on how to accept and enroll in your classes. We encourage you to apply as early as possible to ensure that you have ample time to complete any additional steps that may be required before the session begins. If you have any questions or concerns during the application process, please contact our postgraduate office at postgraduate@kwasu.edu.ng. We’re here to help, and we look forward to welcoming you to Kwara State University for postgraduate studies."
    },
    {
        "content": " KWASU PROMOTES 20 TO PROFESSORIAL CADRE AS THE UNIVERSITY HOLDS 14TH MATRICULATION CEREMONY The Governing Council of Kwara State University, Malete has approved the promotion of twenty staff of the University to the professorial cadre. The ratification was given at the64th Regular Meeting of the Institution’s Governing Council which held on Thursday February 16, 2023. Five among the twenty staff attained full professorship while the fifteen others were promoted to Associate Professorship. The newly promoted Professors are: Professor Taibat Moji Yusuf, Agricultural Production and Resource Use; Professor Dupe Olufunke Ogunbosoye, Ruminant Nutrition; Professor Issa Abdulraheem, Business & Human Resource Management & Entrepreneurship; Professor Salih Muhammed Jum’ah Alaso, Arabic Literature & Nigerian Arabic Poetry Criticism; and, Professor Yahya Duro Uthman Hambali, Criminal Justice and Criminology. The Associate Professors are: Dr. Kayode Ayantoye, Department of Agric Economics and Extension Services; Dr. Ade Isaac Afe, Department of Crop Production; Dr. Adeshina Fadeyibi, Department of Food & Agricultural Engineering; Dr. Adesina Mutalub Lambe, Department of Electrical and Computer Engineering; Dr. Aminu Nassir Brimah, Department of Business & Entrepreneurship; Dr. Kabiru Mustapha and Dr. Abdulrahman Sikiru Ottan, both of the Department of Material Sciences and Engineering. Others are: Dr. Ayoola Oladunke Aransi, Department of English & Linguistics; Dr. Tajudeen Yusuf, Department of Arabic & French; Dr. Zekeri Abu, Department of Business & Entrepreneurship; Dr. Lukman Bola Abdulra’uf, Department of Chemistry & Industrial Chemistry; Dr. Jimoh Ajadi, Department of Geology & Mineral Science; Dr. Henry Sawyer, Department ofEnvironmental Health Science; and, Dr. Majekodunmi Rachael Adedayo and Dr. Adeyinka Elizabeth Ajiboye both of the Department of Microbiology. Meanwhile, nine thousand eight hundred newly admitted students were formally absorbed into the University for the 2022/2023 academic session during the 14th Matriculation Ceremony of the Institution which held on Friday February 17, 2023. In his Matriculation address, the Acting Vice Chancellor, Professor Shaykh-Luqman Jimoh assured the new students that they would receive world class education in the institution, urging them to make the best of the golden opportunity that the school has given them. Professor Jimoh admonished the students against involvement in social vices and other civil disturbances as the University has zero tolerance for indiscipline. Dr. Saeedat AliyuActing Director, University Relations    KWASU Governing Council Ratifies the Promotion of 17 Staff to Professsorial Cadre The governing council of Kwara State University, Malete, on Monday, May 6, 2024, approved the promotion of 6 staff to full Chair and 11 to associate professor. The new professors are Professor Adebayo Abayomi Olowoake with specialisation in Soil Fertility; Professor Lawrence Femi Ademiluyi, who specialises in Entrepreneurship, Office Technology and Management; Professor Adeoye Afolabi specialist in Corporate & Public Finance, and Professor Isiaka Aliagan who is a specialist in Journalism and Media Studies. The others are Professor Sikiru Akinyeye Ahmed specialist in Physical and Computational Chemistry and Professor Aliru Olajide Mustapha specialist in Analytical, Environmental and Industrial Chemistry. The new associate professors are Dr. Aliyu Okuta Ahmed, specialist in Arabic Language; Dr. Abdulrasaq Mustapha, Management Accounting, Accounting Theory and Taxation; Dr. Abdulrahman O. Mustapha, Enterprise Creation, Incubation and Development; Engr. Dr. Abdulwaheed Musa, Engineering Wireless Communication, Artificial Intelligence and Renewable Energy; Engr. Dr. Sefiu Bello Adekunle, Materials Characterisation and Development; and, Dr. Abdulrafiu Mope Isiaka, who specialises in Information System and Pattern Recognition. The others are Dr. Kafayat Yetunde Olatinwo, specialist in International Space Law; Dr. Oyeshola Olufemi Animashaun, Tax Law, Business Regulations and Corporate Law; Dr. Adediran Dauda Olushola, Pure Mathematics; Dr. Sunday Ojo, Parasitology; and Dr. Abdullahi Taiwo Ajao, specialist in Environmental Microbiology. Dr. Saeedat AliyuAg. Director University Relations"
    },
    {
        "content": "Professor Mahfouz Adedimeji, delivering the 5th Humanities Lecture titled “Revitalising the Humanities: Rethinking Canon, Curriculum and Context” on Wednesday, December 18, 2024 at the Ultramodern Performing Arts Theatre. Your email address will not be published. Required fields are marked *  Save my name, email, and website in this browser for the next time I comment.  \n\n Δ Search Categories"
    },
    {
        "content": "KWASU offer a wide range of sports and recreation activities for students to participate in. These include organized sports teams, club sports, fitness classes, outdoor adventure programs, and intramural sports leagues.\n\nOrganized sports teams are usually competitive and represent the university in intercollegiate athletics. These teams may include football, basketball, baseball, soccer, tennis, and many other sports. Students who make the team typically practice several times a week and compete against other colleges and universities.\n\nClub sports are student-run organizations that offer the opportunity for students to participate in a variety of sports and recreational activities. These may include everything from rock climbing and ultimate frisbee to martial arts and equestrian sports.\n\nFitness classes are another popular option for students looking to stay active. Universities often have fitness centers that offer a variety of classes, including yoga, Pilates, spin, and cardio kickboxing.\n\nOutdoor adventure programs offer students the opportunity to participate in activities like hiking, rock climbing, whitewater rafting, and more. These programs may be organized by the university or by student organizations.\n\nIntramural sports leagues are a fun way for students to compete against each other in a variety of sports. These leagues are usually less competitive than organized sports teams and are open to all students, regardless of their skill level.\n\nOverall, KWASU offer a wide range of sports and recreation activities for students to choose from, so there is likely to be something for everyone.\n\n\n\n\n\t\t\t\t\t Organized sports teams are usually competitive and represent the university in intercollegiate athletics. These teams may include football, basketball, baseball, soccer, tennis, and many other sports. Students who make the team typically practice several times a week and compete against other colleges and universities.\n\nClub sports are student-run organizations that offer the opportunity for students to participate in a variety of sports and recreational activities. These may include everything from rock climbing and ultimate frisbee to martial arts and equestrian sports.\n\nFitness classes are another popular option for students looking to stay active. Universities often have fitness centers that offer a variety of classes, including yoga, Pilates, spin, and cardio kickboxing.\n\nOutdoor adventure programs offer students the opportunity to participate in activities like hiking, rock climbing, whitewater rafting, and more. These programs may be organized by the university or by student organizations.\n\nIntramural sports leagues are a fun way for students to compete against each other in a variety of sports. These leagues are usually less competitive than organized sports teams and are open to all students, regardless of their skill level.\n\nOverall, KWASU offer a wide range of sports and recreation activities for students to choose from, so there is likely to be something for everyone.\n\n\n\n\n\t\t\t\t\t Club sports are student-run organizations that offer the opportunity for students to participate in a variety of sports and recreational activities. These may include everything from rock climbing and ultimate frisbee to martial arts and equestrian sports.\n\nFitness classes are another popular option for students looking to stay active. Universities often have fitness centers that offer a variety of classes, including yoga, Pilates, spin, and cardio kickboxing.\n\nOutdoor adventure programs offer students the opportunity to participate in activities like hiking, rock climbing, whitewater rafting, and more. These programs may be organized by the university or by student organizations.\n\nIntramural sports leagues are a fun way for students to compete against each other in a variety of sports. These leagues are usually less competitive than organized sports teams and are open to all students, regardless of their skill level.\n\nOverall, KWASU offer a wide range of sports and recreation activities for students to choose from, so there is likely to be something for everyone.\n\n\n\n\n\t\t\t\t\t Fitness classes are another popular option for students looking to stay active. Universities often have fitness centers that offer a variety of classes, including yoga, Pilates, spin, and cardio kickboxing.\n\nOutdoor adventure programs offer students the opportunity to participate in activities like hiking, rock climbing, whitewater rafting, and more. These programs may be organized by the university or by student organizations.\n\nIntramural sports leagues are a fun way for students to compete against each other in a variety of sports. These leagues are usually less competitive than organized sports teams and are open to all students, regardless of their skill level.\n\nOverall, KWASU offer a wide range of sports and recreation activities for students to choose from, so there is likely to be something for everyone.\n\n\n\n\n\t\t\t\t\t Outdoor adventure programs offer students the opportunity to participate in activities like hiking, rock climbing, whitewater rafting, and more. These programs may be organized by the university or by student organizations.\n\nIntramural sports leagues are a fun way for students to compete against each other in a variety of sports. These leagues are usually less competitive than organized sports teams and are open to all students, regardless of their skill level.\n\nOverall, KWASU offer a wide range of sports and recreation activities for students to choose from, so there is likely to be something for everyone.\n\n\n\n\n\t\t\t\t\t Intramural sports leagues are a fun way for students to compete against each other in a variety of sports. These leagues are usually less competitive than organized sports teams and are open to all students, regardless of their skill level.\n\nOverall, KWASU offer a wide range of sports and recreation activities for students to choose from, so there is likely to be something for everyone.\n\n\n\n\n\t\t\t\t\t Overall, KWASU offer a wide range of sports and recreation activities for students to choose from, so there is likely to be something for everyone.\n\n\n\n\n\t\t\t\t\t"
    },
    {
        "content": "At KWASU, we believe that student success goes beyond academics. That’s why we offer a wide range of support services and resources to help our students thrive during their time on campus. Our team of student affairs professionals is dedicated to supporting the overall well-being and development of our students. We offer counseling and wellness services, career support, and opportunities for leadership development and civic engagement. We also host a variety of social and recreational events throughout the year, including sports tournaments, cultural festivals, and movie nights. In addition to the resources provided by our team, KWASU students have access to numerous student organizations and clubs that allow them to get involved on campus and connect with their peers. We encourage all of our students to take advantage of the support and resources available to them through the Student Affairs office. If you have any questions or need assistance, please don’t hesitate to reach out to us. We look forward to supporting you on your journey at KWASU! All Kwara State University Graduates from inception."
    },
    {
        "content": "A student union, also known as a student government or student council, is an organization that represents the interests of students at a university or college. The student union is typically made up of elected student leaders and is responsible for advocating for the needs and concerns of the student body.\n\nThe purpose of a student union is to give students a voice in the decision-making process at their institution. This can include issues such as course offerings, campus policies, and the allocation of resources. Student unions often work closely with faculty and administration to address student needs and improve the overall experience for students at the university.\n\nIn addition to advocating for student needs, student unions may also provide a range of services and resources for students. These can include social and recreational activities, support for student organizations, and assistance with career development and job searches.\n\nStudent unions may also play a role in campus life by organizing events and activities, such as lectures, concerts, and festivals. These events provide opportunities for students to engage with each other and the larger community, and can help foster a sense of community on campus.\n\nOverall, a student union is an important resource for students at a university, helping to ensure that their voices are heard and their needs are met.\t\t\t\t\t The purpose of a student union is to give students a voice in the decision-making process at their institution. This can include issues such as course offerings, campus policies, and the allocation of resources. Student unions often work closely with faculty and administration to address student needs and improve the overall experience for students at the university.\n\nIn addition to advocating for student needs, student unions may also provide a range of services and resources for students. These can include social and recreational activities, support for student organizations, and assistance with career development and job searches.\n\nStudent unions may also play a role in campus life by organizing events and activities, such as lectures, concerts, and festivals. These events provide opportunities for students to engage with each other and the larger community, and can help foster a sense of community on campus.\n\nOverall, a student union is an important resource for students at a university, helping to ensure that their voices are heard and their needs are met.\t\t\t\t\t In addition to advocating for student needs, student unions may also provide a range of services and resources for students. These can include social and recreational activities, support for student organizations, and assistance with career development and job searches.\n\nStudent unions may also play a role in campus life by organizing events and activities, such as lectures, concerts, and festivals. These events provide opportunities for students to engage with each other and the larger community, and can help foster a sense of community on campus.\n\nOverall, a student union is an important resource for students at a university, helping to ensure that their voices are heard and their needs are met.\t\t\t\t\t Overall, a student union is an important resource for students at a university, helping to ensure that their voices are heard and their needs are met.\t\t\t\t\t"
    },
    {
        "content": "Loading... Loading... Loading... Loading..."
    },
    {
        "content": "Professor Abubakar Sani Sambo, OON, NPO., delivering the 12th Convocation Lecture titled “The Optimum Utilisation of Nigeria’s Energy Resources for the Sustainable Growth and Development of the Nation” on Thursday, December 12, 2024 at the Mini Convocation Arena. The Convocation Lecture was chaired by Alhaji Sherif Shagaya. Your email address will not be published. Required fields are marked *  Save my name, email, and website in this browser for the next time I comment.  \n\n Δ Search Categories"
    },
    {
        "content": "As the Registrar, it is my pleasure to extend a warm welcome to you. Our department plays a vital role in supporting the academic community and ensuring the smooth functioning of administrative processes in the University. At the Registry Department, our team of dedicated staff works diligently to provide efficient and comprehensive administrative services. From admissions and registration to records management and graduation, we are committed to delivering exceptional services that are tailor-made, meeting the peculiar needs of stakeholders. We guide you every step of the way while you navigate through the various processes. The aim is to provide excellent support services toward ensuring a fulfilling academic experience."
    },
    {
        "content": "I warmly welcome you to the Vice Chancellor's Office of Kwara State University, Malete. This office is more than just a physical place; it is the heart of our university's goals, where ideas are born, plans are made, and dreams are nurtured. It is a space where our past meets our future, and where our dedicated Management, Staff, and Students come together to chart a course. As the Vice Chancellor, I am dedicated to excellence in every aspect of our university's mission. I strongly believe in the power of education, research, and community development. Here, we envision a future where every student thrives, where ideas flourish, and where we face challenges with determination and innovation."
    },
    {
        "content": "Kwara State University flagged off the State Government’s Drug Testing Policy for Tertiary Institutions on Friday, December 20, 2024. Your email address will not be published. Required fields are marked *  Save my name, email, and website in this browser for the next time I comment.  \n\n Δ Search Categories"
    },
    {
        "content": " A one day interactive workshop for Deans of Faculties, Directors of Academic Centers and Heads of Departments on the content and expectations of the newly introduced Core Curriculum Minimum Standard (CCMAS) held on Tuesday January 17, 2023.The Acting Vice Chancellor, Professor Shaykh Luqman Jimoh described the new curriculum benchmark as an innovation to standardise university curriculum. The event which was held at the Kwara State Banquet Hall, had in attendance the Governor of Kwara State, Mallam AbdulRahman AbdulRazaq who received the award on behalf of the institution."
    }
]